---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.Alignment.DisplayedEndStation
source: html/cfde7e75-8057-a6d2-4493-428a035af8e0.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.DisplayedEndStation Property

Specifies the station at which the alignment's display ends, in Revit internal model units (standard Imperial feet).

## Syntax (C#)
```csharp
public double DisplayedEndStation { get; }
```

## Remarks
This station is within the alignment's geometric definition range ( StartStation , EndStation ).